package com.test;

/* 문 1] -50에서 1까지의 수를 출력하는 프로그램을 작성하라
이때, 한 줄에는 5개의 수만을 출력하고, 수들 사이를 탭 간격만큼 띄어라.

출력 결과

        -50     -49     -48     -47     -46
        -45     -44     -43     -42     -41
        -40     -39     -38     -37     -36
        -35     -34     -33     -32     -31
        -30     -29     -28     -27     -26
        -25     -24     -23     -22     -21
        -20     -19     -18     -17     -16
        -15     -14     -13     -12     -11
        -10     -9      -8      -7      -6
        -5      -4      -3      -2      -1
        0       1
*/

public class HomeWork04 {

	public static void main(String[] args) {

		int i = -50; // 초기값

		while (i <= 1) {
			System.out.printf("\t%d\t", i);
			i++;
			if (i % 5 == 0)
				System.out.println();
		}
	}
}
