package com.condition; // 야, 이 코드가 여기 산다. 주소 박아놨으니까 딴 데서 헤매지 마라.

/* 제어문의 종류
1. 분기문(비교조건문) -> if, switch문
- 조건에 따라 코드를 다르게 실행해서 다른 결과를 뽑아내는 거다.

2. 반복문: 특정 코드를 정해진 규칙에 따라 계속 돌리는 거다.
for, while, do~while

3. break문: 반복문 돌다가 빡치면 바로 뛰쳐나갈 때 쓴다.

4. continue문: 이번 차례는 건너뛰고 다음 차례로 바로 넘어갈 때 쓴다.
*/ // 제어문 종류랑 뭔지 대충 설명해놨다.

public class IfEx01 { // 야, IfEx01 이름으로 프로그램 시작한다. 이 파일 이름이랑 똑같으니까 틀리면 뒤진다.

	public static void main(String[] args) { // 여기가 진짜 시작점이다. 무조건 여기부터 실행된다고 보면 됨.

		int a = 10; // a라는 int(정수) 변수에 10 박아 넣었다.

		if (a == 10) { // 만약 a가 10이랑 똑같으면 (조건이 참이면) 이 안의 코드 실행된다.
		// 실행할 문장이 여러 개면 {} 이거 꼭 써줘야 한다.
		System.out.println("a는 10값과 같습니다."); // "a는 10값과 같습니다." 화면에 보여준다.
		} else { // 만약 if 조건이 거짓이면 (a가 10이랑 안 같으면) 이 안의 코드 실행된다.
		System.out.println("a는 10값과 같지 않습니다."); // "a는 10값과 같지 않습니다." 화면에 보여준다.
		}
	}
}
