package com.objectex;

/*  변수 종류    		선언위치     	생성시기
------------------------------------------------------
 	클래스 변수   |  클래스 영역  | 클래스가 만들어져서 메모리에 로딩될때 
-------------- |--------------------------------------
 	인스턴스 변수  | 클래스 영역   | 인스턴스(객체)가 생성될때 
 -----------------------------------------------------
 	지역 변수     | 클래스 영역 이외의 영역		   | 변수 선언문이 수행될 때
 			   | 메소드, 생성자, 초기화 블럭 내부   |
 -----------------------------------------------------
 
  1. 인스턴스 변수 (Instance variable)
  	클래스 영역에 선언되며, 클래스의 인스턴스를 생성할 때 만들어진다.
  	인스턴스는 독립적인 저장공간을 가지므로 서로 다른 값을 가질 수 있다. 
  	
  2. 클래스 변수 (Class variable) 
  	인스턴스 변수 앞에 static을 붙이기만 하면 클래스 변수임 
  	- 모든 인스턴스가 공통된 저장 공간(변수)을 공유 하게 됨 
  	  한 클래스의 모든 인스턴트들이 공통적인 값을 유지해야하는 속성의 경우 클래스 변수로 선언함
  	  
  	  
  3. 지역 변수 (Local variable)
  	- 블럭을 지정한 범위 내에서 선언한 변수를 의미함
  	(반복문, 메서드, 조거문) 
  	선언된 블록내에서만 사용가능하며, 블럭을 벗어나면 자동으로 소멸되어 사용할 수 없다.
 */

public class Variables {
	
 // -------------클래스 영역에서 사용하는 변수----------		
		int iv; // 인스턴스 변수
		static int cv; // 클래스 변수(static 변수, 공유 변수)
 // --------------------------------------------		
	
		void method() {
			int iv = 0;  // 지역 변수
		}	
	}